public class Main {
    public static void main(String[] args) {

        int oneMile = 20; // 1 миля
        int ticketPrice = 42568; // цена билета
        int amountOfMiles = ticketPrice / oneMile; // сумма миль
        System.out.print(amountOfMiles);

        /* Объявляете переменные для входных данных и
         параметров программы: одну для хранения
         стоимости билета, другую для хранения количества
         рублей для одной бонусной мили

         Рассчитываете количество бонусных миль, используя
         значения заведённых переменных. Ответ сохраняете в
         новую переменную и выводите на экран */
    }
}